#ifndef _DMA_COPY_H_
#define _DMA_COPY_H_

//=============================================================//
//使用硬件dma模块搬运数据, 注意:
// 1) dest和src地址需要4byte对齐
// 2)目前支持单模块使用;
// 3)典型应用: IMB 乒乓buf搬数到psram;
//=============================================================//
void dma_memcpy(void *dest, void *src, u32 len);

//=============================================================//
// 等待dma_copy完成, 用于同步操作
//=============================================================//
void dma_memcpy_wait_idle(void);

#endif /* #ifndef _DMA_COPY_H_ */
