/*********************************************************************************************
    *   Filename        : app_connected.h

    *   Description     :

    *   Author          : Weixin Liang

    *   Email           : liangweixin@zh-jieli.com

    *   Last modifiled  : 2022-12-15 14:34

    *   Copyright:(c)JIELI  2011-2022  @ , All Rights Reserved.
*********************************************************************************************/
#ifndef _APP_CONNECTED_H
#define _APP_CONNECTED_H

/*  Include header */
#include "typedef.h"
#include "wireless_trans.h"

#ifdef __cplusplus
extern "C" {
#endif

/**************************************************************************************************
  Macros
**************************************************************************************************/

/**************************************************************************************************
  Data Types
**************************************************************************************************/
enum {
    APP_CONNECTED_STATUS_STOP = 0x1,
    APP_CONNECTED_STATUS_START = 0x2,
    APP_CONNECTED_STATUS_SUSPEND = 0x4,
    APP_CONNECTED_STATUS_CONNECT = 0x8,
    APP_CONNECTED_STATUS_DISCONNECT = 0x10,
    APP_CONNECTED_STATUS_MUSIC = 0x20,
    APP_CONNECTED_STATUS_PHONE_CALL = 0x40,
};

enum {
    APP_CONNECTED_ROLE_UNKNOW,
    APP_CONNECTED_ROLE_TRANSMITTER,
    APP_CONNECTED_ROLE_RECEIVER,
    APP_CONNECTED_ROLE_DUPLEX,
};

/**************************************************************************************************
  Global Variables
**************************************************************************************************/

/**************************************************************************************************
  Function Declarations
**************************************************************************************************/

/* --------------------------------------------------------------------------*/
/**
 * @brief 开启CIG
 *
 * @param pair_without_addr:不匹配配对地址，重新自由配对
 */
/* ----------------------------------------------------------------------------*/
void app_connected_open(u8 pair_without_addr);

/* --------------------------------------------------------------------------*/
/**
 * @brief 关闭对应cig_hdl的CIG连接
 *
 * @param cig_hdl:需要关闭的CIG连接对应的hdl
 * @param status:关闭后CIG进入的suspend还是stop状态
 */
/* ----------------------------------------------------------------------------*/
void app_connected_close(u8 cig_hdl, u8 status);

/* --------------------------------------------------------------------------*/
/**
 * @brief 关闭所有cig_hdl的CIG连接
 *
 * @param status:关闭后CIG进入的suspend还是stop状态
 */
/* ----------------------------------------------------------------------------*/
void app_connected_close_all(u8 status);

/* --------------------------------------------------------------------------*/
/**
 * @brief CIG开关切换
 *
 * @return -1:切换失败，0:切换成功
 */
/* ----------------------------------------------------------------------------*/
int app_connected_switch(void);

/* --------------------------------------------------------------------------*/
/**
 * @brief 更新系统当前处于的场景
 *
 * @param scene:当前系统状态
 *
 * @return 0:success
 */
/* ----------------------------------------------------------------------------*/
int update_app_connected_deal_scene(int scene);

/* --------------------------------------------------------------------------*/
/**
 * @brief CIG开启情况下，不同场景的处理流程
 *
 * @param scene:当前系统状态
 *
 * @return -1:无需处理，0:处理事件但不拦截后续流程，1:处理事件并拦截后续流程
 */
/* ----------------------------------------------------------------------------*/
int app_connected_deal(int scene);

/* --------------------------------------------------------------------------*/
/**
 * @brief 获取当前是否在退出模式的状态
 *
 * @return 1；是，0：否
 */
/* ----------------------------------------------------------------------------*/
u8 get_connected_app_mode_exit_flag(void);

/* --------------------------------------------------------------------------*/
/**
 * @brief CIG资源初始化
 */
/* ----------------------------------------------------------------------------*/
void app_connected_init(void);

/* --------------------------------------------------------------------------*/
/**
 * @brief CIG资源卸载
 */
/* ----------------------------------------------------------------------------*/
void app_connected_uninit(void);

/* --------------------------------------------------------------------------*/
/**
 * @brief ACL数据发送接口
 *
 * @param device_channel:发送给远端设备的标识
 * @param data:需要发送的数据
 * @param length:数据长度
 *
 * @return slen:实际发送数据的总长度
 */
/* ----------------------------------------------------------------------------*/
int app_connected_send_custom_data(u8 device_channel, void *data, size_t length);

/* --------------------------------------------------------------------------*/
/**
 * @brief 判断对应设备标识的CIS当前是否处于连接状态
 *
 * @param device_channel:远端设备标识
 *
 * @return connected_status:连接状态，按bit判断
 */
/* ----------------------------------------------------------------------------*/
u8 app_cis_is_connected(u8 device_channel);

/* --------------------------------------------------------------------------*/
/**
 * @brief 非蓝牙后台情况下，在其他音源模式开启CIG，前提要先开蓝牙协议栈
 */
/* ----------------------------------------------------------------------------*/
void app_connected_open_in_other_mode();

/* --------------------------------------------------------------------------*/
/**
 * @brief
 * @brief 非蓝牙后台情况下，在其他音源模式关闭CIG
 */
/* ----------------------------------------------------------------------------*/
void app_connected_close_in_other_mode();

/* --------------------------------------------------------------------------*/
/**
 * @brief CIG连接角色重定义
 *
 * @return 设备角色为发送设备还是接收设备
 */
/* ----------------------------------------------------------------------------*/
u8 app_get_connected_role(void);

/* --------------------------------------------------------------------------*/
/**
 * @brief 清除配对信息，并重新配对
 */
/* ----------------------------------------------------------------------------*/
void app_connected_remove_pairs_addr(void);

/* --------------------------------------------------------------------------*/
/**
 * @brief CIG连接成功后central发起音量同步
 */
/* ----------------------------------------------------------------------------*/
void app_connected_sync_volume(u8 remote_dev_identification);


u8 is_cig_phone_conn();
u8 is_cig_other_phone_conn();

bool get_connected_on_off(void);

u8 get_connected_cis_num(void);

int app_connected_role_switch(void);
int app_connected_open_with_role(u8 role_in, u8 pair_without_addr);
u8 get_bt_le_audio_config_for_vm();
u8 get_bt_le_audio_config();
u8 is_cig_phone_call_play();
u8 is_cig_music_play();
//3In1 项目专用
bool is_open_cis_connet(void);

u8 get_cis_switch_onoff(void);
#ifdef __cplusplus
};
#endif

#endif

